; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	infrared0 - mode
	infrared2 - mode
	spectrograph1 - mode
	infrared3 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation1 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared0)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared0)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 spectrograph1)
	(supports instrument3 infrared3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation5)
	(supports instrument4 infrared0)
	(supports instrument4 infrared2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 infrared3)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument6 infrared2)
	(supports instrument6 infrared3)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 Star6)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Planet8 spectrograph1)
	(have_image Planet9 spectrograph1)
	(have_image Star10 infrared3)
	(have_image Planet11 infrared2)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon13 infrared0)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 7
2. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 7
3. (turn_to satellite2 planet11 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet11)
   goals met: 0 of 7
4. (take_image satellite2 planet11 instrument6 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 1 of 7
5. (turn_to satellite2 phenomenon13 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon13)
   goals met: 1 of 7
6. (take_image satellite2 phenomenon13 instrument6 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 7
7. (turn_to satellite2 phenomenon12 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 7
8. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 7
9. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 2 of 7
10. (take_image satellite2 phenomenon12 instrument6 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 3 of 7
11. (turn_to satellite0 planet8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet8)
   goals met: 3 of 7
12. (take_image satellite0 planet8 instrument2 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 4 of 7
13. (turn_to satellite0 planet9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet9)
   goals met: 4 of 7
14. (take_image satellite0 planet9 instrument2 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 5 of 7
15. (turn_to satellite0 groundstation1 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation1)
   goals met: 6 of 7
16. (turn_to satellite2 star10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star10)
   goals met: 6 of 7
17. (take_image satellite2 star10 instrument6 infrared3)
   added: (have_image star10 infrared3)
   goals met: 7 of 7
